DataProcessors/АК_ОтправитьНаДегустацию.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<DataProcessor>
		<Properties>
			<Name>АК_ОтправитьНаДегустацию</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/АК_ЗаданияНаДегустациюНочные.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>АК_ЗаданияНаДегустациюНочные</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаДегустации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Результат</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаПроизводства</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

DataProcessors/АК_ОтправитьНаДегустацию/Forms/Форма/Ext/Form/Module.bsl
&НаКлиенте
Процедура ОтправитьНаДегустацию(Команда)
	ОтправитьНаДегустациюНаСервере();
	ЗаполнитьСписок();
КонецПроцедуры

&НаСервере
Процедура ОтправитьНаДегустациюНаСервере()
	Отбор = Новый Структура("Пометка", Истина);
	МассивОтбора = ТабНоменклатуры.НайтиСтроки(Отбор);
	Для каждого СтрокаСписка Из МассивОтбора Цикл
		НоваяЗапись = РегистрыСведений.АК_ЗаданияНаДегустациюНочные.СоздатьМенеджерЗаписи();
		НоваяЗапись.Номенклатура = СтрокаСписка.Номенклатура;
		НоваяЗапись.Характеристика = СтрокаСписка.Характеристика;
		НоваяЗапись.ДатаРегистрации = ТекущаяДата();
		НоваяЗапись.ДатаПроизводства = СтрокаСписка.ДатаПроизводства;
		НоваяЗапись.Комментарий = СтрокаСписка.Комментарий;
		НоваяЗапись.Записать(Истина);
	КонецЦикла; 
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписок()
	ВремТаб = ТабНоменклатуры.Выгрузить();
	Отбор = Новый Структура("Пометка", Истина);
	МассивОтбора = ВремТаб.НайтиСтроки(Отбор);
	
	ТабНоменклатуры.Очистить();
	
	ТабНоменклатуры.Загрузить(ВремТаб);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	АК_ЗаданияНаДегустациюНочные.Номенклатура,
		|	АК_ЗаданияНаДегустациюНочные.Характеристика,
		|	АК_ЗаданияНаДегустациюНочные.ДатаРегистрации,
		|	АК_ЗаданияНаДегустациюНочные.ДатаПроизводства,
		|	АК_ЗаданияНаДегустациюНочные.Комментарий,
		|	АК_ЗаданияНаДегустациюНочные.ДатаДегустации,
		|	АК_ЗаданияНаДегустациюНочные.Результат
		|ИЗ
		|	РегистрСведений.АК_ЗаданияНаДегустациюНочные КАК АК_ЗаданияНаДегустациюНочные
		|ГДЕ
		|	АК_ЗаданияНаДегустациюНочные.ДатаРегистрации МЕЖДУ &ДатаНачала И &ДатаОкончания";
	
	Если Фильтр = 3 Тогда
		Запрос.Текст = Запрос.Текст + "
		|	И АК_ЗаданияНаДегустациюНочные.ДатаДегустации = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)";
	ИначеЕсли Фильтр = 2 Тогда
		Запрос.Текст = Запрос.Текст + "
		|	И Не АК_ЗаданияНаДегустациюНочные.ДатаДегустации = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)";
	КонецЕсли; 
	
	Запрос.Текст = Запрос.Текст + "
		|УПОРЯДОЧИТЬ ПО
		|	АК_ЗаданияНаДегустациюНочные.ДатаРегистрации УБЫВ";
		
	
	Запрос.УстановитьПараметр("ДатаНачала", НачалоДня(ДатаНачала));
	Запрос.УстановитьПараметр("ДатаОкончания", КонецДня(ДатаОкончания));
	
	ТабНоменклатуры.Загрузить(Запрос.Выполнить().Выгрузить());
	
	Для каждого СтрокаМассива Из МассивОтбора Цикл
		НоваяСтрока = ТабНоменклатуры.Вставить(0);
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаМассива);
	КонецЦикла; 
	
КонецПроцедуры
 

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Не ЗначениеЗаполнено(ДатаНачала) Тогда
		ДатаНачала = НачалоМесяца(ТекущаяДата());
	КонецЕсли; 
	Если Не ЗначениеЗаполнено(ДатаОкончания) Тогда
		ДатаОкончания = ТекущаяДата();
	КонецЕсли; 
	
	Фильтр = 3;
	
	ЗаполнитьСписок();
	
КонецПроцедуры

&НаКлиенте
Процедура ТабНоменклатурыПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	Элемент.ТекущиеДанные.Пометка = Истина;
	Элемент.ТекущиеДанные.ДатаРегистрации = ТекущаяДата();
КонецПроцедуры

&НаКлиенте
Процедура ФильтрПриИзменении(Элемент)
	ЗаполнитьСписок();
КонецПроцедуры

&НаКлиенте
Процедура Обновить(Команда)
	ЗаполнитьСписок();

КонецПроцедуры

&НаКлиенте
Процедура ТабНоменклатурыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Если Не Элемент.ТекущиеДанные.Пометка = Истина Тогда
		СтандартнаяОбработка = Ложь;
		Возврат;
	КонецЕсли; 
КонецПроцедуры
